app/Models/CategoriesPortfolioItemsModel.php

    public function getCategoriesPortfolioItems($id = false) {

        if($id == false) {
            return $this->findAll();
---
SELECT *
FROM `categories_portfolio_items`