app/Models/PortfolioItemsModel.php

SELECT *
FROM `portfolio_items`
WHERE `id_portfolio_item` = '6'
 LIMIT 1
---
                return $query->getResultArray();
        }

        return $this->asArray()
            ->where(['id_portfolio_item' => $id])
            ->first();

SELECT COUNT(*) AS `numrows` FROM `portfolio_items`
---
    public function count() {

        $builder = $this->db->table('portfolio_items');

        return $builder->countAll();